===
Lambda Syntax
===

(a, b, c) => a + b + c
(a) => a + 1
a => a - 1
(a => a + 1)
(=> 42)
((_=None) => 42)
() => 42

---

(module
	(expression_statement
		(lambda
			(lambda_parameters
				(identifier)
				(identifier)
				(identifier))
			(binary_operator
				(binary_operator
					(identifier)
					(identifier))
				(identifier))))
	(expression_statement
		(lambda
			(lambda_parameters
				(identifier))
			(binary_operator
				(identifier)
				(integer))))
	(expression_statement
		(lambda
			(lambda_parameters
				(identifier))
			(binary_operator
				(identifier)
				(integer))))
	(expression_statement
		(parenthesized_expression
			(lambda
				(lambda_parameters
					(identifier))
				(binary_operator
					(identifier)
					(integer)))))
	(expression_statement
		(parenthesized_expression
			(lambda
					(integer))))
	(expression_statement
		(parenthesized_expression
			(lambda
				(lambda_parameters
					(default_parameter
						(identifier)
						(none)))
					(integer))))
	(expression_statement
		(lambda
			(lambda_parameters)
			(integer))))


===
Deprecated lambda syntax "->"
===


(a, b, c) -> a + b + c
(a) -> a + 1
a -> a - 1
(a -> a + 1)
(-> 42)
((_=None) -> 42)
() -> 42

---

(module
	(expression_statement
		(lambda
			(lambda_parameters
				(identifier)
				(identifier)
				(identifier))
			(binary_operator
				(binary_operator
					(identifier)
					(identifier))
				(identifier))))
	(expression_statement
		(lambda
			(lambda_parameters
				(identifier))
			(binary_operator
				(identifier)
				(integer))))
	(expression_statement
		(lambda
			(lambda_parameters
				(identifier))
			(binary_operator
				(identifier)
				(integer))))
	(expression_statement
		(parenthesized_expression
			(lambda
				(lambda_parameters
					(identifier))
				(binary_operator
					(identifier)
					(integer)))))
	(expression_statement
		(parenthesized_expression
			(lambda
					(integer))))
	(expression_statement
		(parenthesized_expression
			(lambda
				(lambda_parameters
					(default_parameter
						(identifier)
						(none)))
					(integer))))
	(expression_statement
		(lambda
			(lambda_parameters)
			(integer))))


===
lambdas (coconut docs example)
===

dubsums = map((x, y) => 2*(x+y), range(0, 10), range(10, 20))
dubsums |> list |> print

---

(module // todo
	())


===
implicit lambdas (docs)
===

import random

square = (=> _**2)
get_random_number = (=> random.random())

---

(module
  (import_statement
    (dotted_name
      (identifier)))
  (expression_statement
    (assignment
      (identifier)
      (parenthesized_expression
        (lambda
          (binary_operator
            (identifier)
            (integer))))))
  (expression_statement
    (assignment
      (identifier)
      (parenthesized_expression
        (lambda
          (call
            (attribute
              (identifier)
              (identifier))
            (argument_list)))))))

===
Partial application
===

f$(12)
g$(a,b)
h$(a)(b)
f$(?,12)
f$(option='foo')
f$(1,?,3)

---

(module
  (expression_statement
    (partial
      (identifier)
      (partial_argument_list
        (integer))))
  (expression_statement
    (partial
      (identifier)
      (partial_argument_list
        (identifier)
        (identifier))))
  (expression_statement
    (call
      (partial
        (identifier)
        (partial_argument_list
          (identifier)))
      (argument_list
        (identifier))))
  (expression_statement
    (partial
      (identifier)
      (partial_argument_list
        (deferred_argument)
        (integer))))
  (expression_statement
    (partial
      (identifier)
      (partial_argument_list
        (keyword_argument
          (identifier)
          (string
            (string_start)
            (string_content)
            (string_end))))))
  (expression_statement
    (partial
      (identifier)
      (partial_argument_list
        (integer)
        (deferred_argument)
        (integer)))))

===
Partial application: converting keyword arguments to position arguments
===

f$(x=?)
g$(12,option=?)

---

(module
  (expression_statement
    (partial
      (identifier)
      (partial_argument_list
        (keyword_converted_to_positional
          (identifier)
          (deferred_argument)))))
  (expression_statement
    (partial
      (identifier)
      (partial_argument_list
        (integer)
        (keyword_converted_to_positional
          (identifier)
          (deferred_argument))))))

===
Partial application (docs)
===

expnums = range(5) |> map$(pow$(?, 2))
expnums |> list |> print

---

